cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'remind101/formulae'
tap 'wata727/tflint'

# OS X Apps via Homebrew
# https://caskroom.github.io/
tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'awscli'
brew 'bat'
brew 'chrome-cli'
brew 'convox'
brew 'coreutils'
brew 'csvkit'
brew 'ctop'
brew 'dos2unix'
brew 'git'
brew 'go'
brew 'grc'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'node'
brew 'openssl'
brew 'packer'
brew 'postgresql'
brew 'pup'
brew 'pv'
brew 'python'
brew 'assume-role'
brew 'rbenv'
brew 'shellcheck'
brew 'sshuttle'
brew 'stern'
brew 'sqlparse'
brew 'terraform'
brew 'tflint'
brew 'the_silver_searcher'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'wrk'
brew 'youtube-dl'
brew 'zsh'

cask '1password'
cask 'alfred'
cask 'angry-ip-scanner'
cask 'backblaze'
cask 'ccmenu'
cask 'charles'
cask 'disk-drill'
cask 'dash'
cask 'docker'
cask 'droplr'
cask 'evernote'
cask 'flux'
cask 'google-chrome'
cask 'minikube'
cask 'moom'
cask 'iterm2'
cask 'plug'
cask 'rescuetime'
cask 'rowmote-helper'
cask 'slack'
cask 'sublime-text'
cask 'thingsmacsandboxhelper'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'webtorrent'

cask 'font-source-code-pro'

mas 'Airmail', id: 918858936
mas 'Amphetamine', id: 937984704
mas 'Fantastical', id: 975937182
mas 'iFlicks', id: 731062389
mas 'Moom', id: 419330170
mas 'Pixelmator', id: 407963104
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'UTC Bar', id: 525372278