cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'remind101/formulae'
tap 'wagoodman/dive'
tap 'wata727/tflint'

# OS X Apps via Homebrew
# https://caskroom.github.io/
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

brew 'awscli'
brew 'bat'
brew 'chrome-cli'
brew 'cloc'
brew 'convox'
brew 'coreutils'
brew 'csvkit'
brew 'ctop'
brew 'dive'
brew 'fd'
brew 'git'
brew 'go'
brew 'grc'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'jid'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'mas'
brew 'node'
brew 'openssl'
brew 'packer'
brew 'postgresql'
brew 'pup'
brew 'pv'
brew 'python'
brew 'rbenv'
brew 'shellcheck'
brew 'sshuttle'
brew 'stern'
brew 'sqlparse'
brew 'terraform'
brew 'tflint'
brew 'the_silver_searcher'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'wrk'
brew 'youtube-dl'
brew 'zsh'

cask '1password'
cask 'adobe-creative-cloud'
cask 'adobe-photoshop-lightroom'
cask 'adobe-photoshop-lightroom600'
cask 'air-video-server-hd'
cask 'alfred'
cask 'angry-ip-scanner'
cask 'backblaze'
cask 'charles'
cask 'disk-drill'
cask 'dash'
cask 'docker'
cask 'droplr'
cask 'evernote'
cask 'flux'
cask 'google-chrome'
cask 'hazel'
cask 'minikube'
cask 'iterm2'
cask 'plug'
cask 'rescuetime'
cask 'screens-connect'
cask 'slack'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'webtorrent'

cask 'font-source-code-pro'

mas 'Airmail', id: 918858936
mas 'Amphetamine', id: 937984704
mas 'Bear Notes', id: 1091189122
mas 'Deliveries', id: 924726344
mas 'Fantastical', id: 975937182
mas 'Ghostery Lite', id: 1436953057
mas 'HazeOver', id: 430798174
mas 'iFlicks', id: 731062389
mas 'Magnet', id: 441258766
mas 'Paprika', id: 1303222628
mas 'Pixelmator', id: 407963104
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'UTC Bar', id: 525372278