HashiCorp.terraform
golang.Go
ms-azuretools.vscode-docker
timonwong.shellcheck
ms-kubernetes-tools.vscode-kubernetes-tools
jetmartin.bats
deerawan.vscode-dash
eamodio.gitlens
dbaeumer.vscode-eslint
redhat.vscode-yaml
stkb.rewrap
editorconfig.editorconfig
